title: Potential Password Spraying via Windows Security Event Logs
id: a6a2a783-6ee4-4183-8656-53d9db660fc4
status: experimental
description: Detects patterns indicative of password spraying attacks where multiple failed logon attempts occur against different user accounts from the same source IP address. This rule focuses on Event ID 4625 (An account failed to log on) with specific status codes and logon types commonly associated with remote authentication attempts against cloud-synced or local domain environments.
author: DetectForge
date: 2026/02/10
modified: 2026/02/10
tags:
  - attack.initial_access
  - attack.credential_access
  - attack.t1110.003
logsource:
  product: windows
  service: security
detection:
  selection_failed_logon:
    EventID:
      - 4625
    LogonType:
      - 3
      - 8
      - 10
    Status:
      - "0xC000006A"
      - "0xc0000064"
  filter_local_system:
    TargetUserName:
      - ANONYMOUS LOGON
      - -$
      - SYSTEM
  filter_internal_ips:
    IpAddress:
      - 127.0.0.1
      - ::1
  condition: selection_failed_logon and not (filter_local_system or filter_internal_ips) | count(TargetUserName) by IpAddress > 10
falsepositives:
  - Misconfigured applications or service accounts attempting to authenticate with expired credentials across multiple nodes
  - Internal vulnerability scanners performing authenticated scans
  - Public-facing servers (like Exchange or VPN gateways) experiencing automated internet noise
level: high
